<html><head><title>Dec98: Paradigms Past: Paul Erd&ouml;s</title></head><body bgcolor="FFFFFF"><!--Copyright &#169; Dr. Dobb's Journal--><p><i>Dr. Dobb's Journal</i> December 1998 </p><h1>Paradigms Past: Paul Erd&ouml;s</h1><hr><p>Paul Erd&ouml;s died in 1996. If you don't know who this legendary mathematician was, this little look back at his life will inform you. I first heard of Paul Erd&ouml;s from one of my professors in grad school. He had collaborated with Erd&ouml;s on a paper. Too bad I never wrote a paper with that professor, because -- but I'll explain about Erd&ouml;s collaborations and Erd&ouml;s numbers in a moment.</p><p>One reason Erd&ouml;s is legendary is that he was prolific. He holds a record for the most papers written (about 1500), and for the number of coauthors (about 500).</p><p>A better reason is that he was brilliant. While a student, he came up with an elegant proof that for every <i>n </i>there is a prime between <i>n</i> and 2<i>n</i> (not the first proof, but the cleverness and elegance of Erd&ouml;s' proof was typical of his work throughout his life).</p><p>But Erd&ouml;s is perhaps most famous for his eccentricities. To stand out among mathematicians for your eccentricities is quite an accomplishment, but when it came to being peculiar, Erd&ouml;s was a mathematician's mathematician.</p><p>He was a sort of mathematical gypsy, with no fixed home. He would fly from university to university around the world, carrying almost no luggage, stay in the home of one mathematician or another, "pose problems, inspire the locals with his brilliant ideas, and depart in a few days, leaving behind his exhausted hosts to work out the details of their joint work," as they put it in his <i>London Daily Telegraph</i> obituary.</p><p>Erd&ouml;s was also known for offering cash prizes for the solutions to problems he posed, ranging from $10 to $10,000. He won many awards, some of which carried cash grants, but gave the money away freely. When he was given the $50,000 Wolf Prize in Israel, he gave away all but $720, half of it to a needy second cousin he hardly knew.</p><p>Erd&ouml;s' fame and his large number of collaborators have led to a curious sort of game among mathematicians, much like the game involving degrees of separation from actor Kevin Bacon. The game just consists of computing one's Erd&ouml;s number. Any mathematician has an Erd&ouml;s number: This is the number of steps the mathematician is from Erd&ouml;s via collaboration links. For example, all Erd&ouml;s collaborators have an Erd&ouml;s number of one; all their collaborators have an Erd&ouml;s number of two (unless they are also Erd&ouml;s collaborators, in which case their number is one). Low Erd&ouml;s numbers are marks of prestige among mathematicians, or at least among those who play the game.</p><p>So you see why I wish I had collaborated with the Erd&ouml;s collaborator. It happens that there is an obscure link between the circle of actors who have acted with Kevin Bacon and the circle of mathematicians who have collaborated with Paul Erd&ouml;s, so the two games are really just local neighborhoods of a larger game.</p><p>For more on Erd&ouml;s numbers, and to get a start on computing your own Erd&ouml;s number, visit the Erd&ouml;s Number Project site (http://www.acs.oakland .edu/~grossman/erd&ouml;shp.html), where you will learn that all Fields medal winners through 1998 have Erd&ouml;s numbers less than six and that at least 63 Nobel prize winners have Erd&ouml;s numbers less than nine. For more about this extraordinary mathematician, you might read <i>The Man Who Loved Only Numbers: The Story of Paul Erd&ouml;s and the Search for Mathematical Truth</i> by Paul Hoffman (Hyperion, New York, 1998).</p><p> -- M.S.</p><P><A HREF="9812k.htm#rs1">Back to Article</A></P><HR><I>Copyright &copy; 1998, Dr. Dobb's Journal</I><BR>
</body></html>